<?php

return [
    'public' => [
        'done' => 'تمت العملية ينجاح',
        'server_error' => 'حدث خطأ ما، يرجى المحاولة لاحقاً',
    ],
    'auth' => [
        'validation_error' => 'خطأ في التحقق',
        'invalid_route' => 'الرابط المطلوب غير موجود',
        'method_invalid' => 'العملية غير صالحة',
        'related_resource' => 'تعذر إكمال الطلب بسبب وجود تعارض مع الحالة الحالية للمورد الهدف',
        'unauthinicated' => 'الرجاء إعادة المصادقة، انتهت الجلسة',
        'invalid_credentials' => 'اسم المستخدم أو كلمة المرور غير صحيحة',
        'enter_verify_code' => 'حسابك غير مؤكد، الرجاء تأكيد حسابك أولاً',
        'blocked' => 'تم حظر حسابك، برجى التواصل مع الإدارة',
        'verify_SMS_done' => 'تم تأكيد حسابك بنجاح',
        'loggedout' => 'تم تسجيل الخروج بنجاح',
        'social_exists' => 'هذا الحساب مرتبط بحساب آخر',
    ],
    'verification' => [
        'invalid' => 'رمز التحقق المدخل غير صحيح، أو منتهي الصلاحية',
    ],
];
